k6/run-mvc-100l-1000vu-30pool.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6-simple.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 2m25s max duration (incl. graceful stop):
              * ramp: Up to 1000 looping VUs for 2m15s over 4 stages (gracefulRampDown: 10s, gracefulStop: 30s)


running (0m00.9s), 0001/1000 VUs, 0 complete and 0 interrupted iterations
ramp   [   1% ] 0001/1000 VUs  0m00.9s/2m15.0s

running (0m01.9s), 0002/1000 VUs, 1328 complete and 0 interrupted iterations
ramp   [   1% ] 0002/1000 VUs  0m01.9s/2m15.0s

running (0m02.9s), 0003/1000 VUs, 5688 complete and 0 interrupted iterations
ramp   [   2% ] 0003/1000 VUs  0m02.9s/2m15.0s

running (0m03.9s), 0005/1000 VUs, 12342 complete and 0 interrupted iterations
ramp   [   3% ] 0005/1000 VUs  0m03.9s/2m15.0s

running (0m04.9s), 0006/1000 VUs, 20949 complete and 0 interrupted iterations
ramp   [   4% ] 0006/1000 VUs  0m04.9s/2m15.0s

running (0m05.9s), 0007/1000 VUs, 31719 complete and 0 interrupted iterations
ramp   [   4% ] 0007/1000 VUs  0m05.9s/2m15.0s

running (0m06.9s), 0009/1000 VUs, 44418 complete and 0 interrupted iterations
ramp   [   5% ] 0009/1000 VUs  0m06.9s/2m15.0s

running (0m07.9s), 0010/1000 VUs, 58578 complete and 0 interrupted iterations
ramp   [   6% ] 0010/1000 VUs  0m07.9s/2m15.0s

running (0m08.9s), 0011/1000 VUs, 73760 complete and 0 interrupted iterations
ramp   [   7% ] 0011/1000 VUs  0m08.9s/2m15.0s

running (0m09.9s), 0013/1000 VUs, 89504 complete and 0 interrupted iterations
ramp   [   7% ] 0013/1000 VUs  0m09.9s/2m15.0s

running (0m10.9s), 0014/1000 VUs, 106127 complete and 0 interrupted iterations
ramp   [   8% ] 0014/1000 VUs  0m10.9s/2m15.0s

running (0m11.9s), 0015/1000 VUs, 123564 complete and 0 interrupted iterations
ramp   [   9% ] 0015/1000 VUs  0m11.9s/2m15.0s

running (0m12.9s), 0017/1000 VUs, 140788 complete and 0 interrupted iterations
ramp   [  10% ] 0017/1000 VUs  0m12.9s/2m15.0s

running (0m13.9s), 0018/1000 VUs, 158475 complete and 0 interrupted iterations
ramp   [  10% ] 0018/1000 VUs  0m13.9s/2m15.0s

running (0m14.9s), 0019/1000 VUs, 175632 complete and 0 interrupted iterations
ramp   [  11% ] 0019/1000 VUs  0m14.9s/2m15.0s

running (0m15.9s), 0040/1000 VUs, 193469 complete and 0 interrupted iterations
ramp   [  12% ] 0040/1000 VUs  0m15.9s/2m15.0s

running (0m16.9s), 0062/1000 VUs, 211090 complete and 0 interrupted iterations
ramp   [  13% ] 0062/1000 VUs  0m16.9s/2m15.0s

running (0m17.9s), 0083/1000 VUs, 228908 complete and 0 interrupted iterations
ramp   [  13% ] 0083/1000 VUs  0m17.9s/2m15.0s

running (0m18.9s), 0105/1000 VUs, 246610 complete and 0 interrupted iterations
ramp   [  14% ] 0105/1000 VUs  0m18.9s/2m15.0s

running (0m19.9s), 0127/1000 VUs, 263641 complete and 0 interrupted iterations
ramp   [  15% ] 0127/1000 VUs  0m19.9s/2m15.0s

running (0m20.9s), 0149/1000 VUs, 281193 complete and 0 interrupted iterations
ramp   [  16% ] 0149/1000 VUs  0m20.9s/2m15.0s

running (0m21.9s), 0171/1000 VUs, 299233 complete and 0 interrupted iterations
ramp   [  16% ] 0171/1000 VUs  0m21.9s/2m15.0s

running (0m22.9s), 0192/1000 VUs, 317431 complete and 0 interrupted iterations
ramp   [  17% ] 0192/1000 VUs  0m22.9s/2m15.0s

running (0m23.9s), 0214/1000 VUs, 335862 complete and 0 interrupted iterations
ramp   [  18% ] 0214/1000 VUs  0m23.9s/2m15.0s

running (0m24.9s), 0236/1000 VUs, 353434 complete and 0 interrupted iterations
ramp   [  18% ] 0236/1000 VUs  0m24.9s/2m15.0s

running (0m25.9s), 0258/1000 VUs, 371144 complete and 0 interrupted iterations
ramp   [  19% ] 0258/1000 VUs  0m25.9s/2m15.0s

running (0m26.9s), 0279/1000 VUs, 388954 complete and 0 interrupted iterations
ramp   [  20% ] 0279/1000 VUs  0m26.9s/2m15.0s

running (0m27.9s), 0301/1000 VUs, 406343 complete and 0 interrupted iterations
ramp   [  21% ] 0301/1000 VUs  0m27.9s/2m15.0s

running (0m28.9s), 0323/1000 VUs, 424065 complete and 0 interrupted iterations
ramp   [  21% ] 0323/1000 VUs  0m28.9s/2m15.0s

running (0m29.9s), 0345/1000 VUs, 441153 complete and 0 interrupted iterations
ramp   [  22% ] 0345/1000 VUs  0m29.9s/2m15.0s

running (0m30.9s), 0367/1000 VUs, 458858 complete and 0 interrupted iterations
ramp   [  23% ] 0367/1000 VUs  0m30.9s/2m15.0s

running (0m31.9s), 0388/1000 VUs, 475364 complete and 0 interrupted iterations
ramp   [  24% ] 0388/1000 VUs  0m31.9s/2m15.0s

running (0m32.9s), 0410/1000 VUs, 492137 complete and 0 interrupted iterations
ramp   [  24% ] 0410/1000 VUs  0m32.9s/2m15.0s

running (0m33.9s), 0432/1000 VUs, 508960 complete and 0 interrupted iterations
ramp   [  25% ] 0432/1000 VUs  0m33.9s/2m15.0s

running (0m34.9s), 0454/1000 VUs, 526434 complete and 0 interrupted iterations
ramp   [  26% ] 0454/1000 VUs  0m34.9s/2m15.0s

running (0m35.9s), 0475/1000 VUs, 544402 complete and 0 interrupted iterations
ramp   [  27% ] 0475/1000 VUs  0m35.9s/2m15.0s

running (0m36.9s), 0497/1000 VUs, 562191 complete and 0 interrupted iterations
ramp   [  27% ] 0497/1000 VUs  0m36.9s/2m15.0s

running (0m37.9s), 0519/1000 VUs, 580255 complete and 0 interrupted iterations
ramp   [  28% ] 0519/1000 VUs  0m37.9s/2m15.0s

running (0m38.9s), 0541/1000 VUs, 597764 complete and 0 interrupted iterations
ramp   [  29% ] 0541/1000 VUs  0m38.9s/2m15.0s

running (0m39.9s), 0563/1000 VUs, 615089 complete and 0 interrupted iterations
ramp   [  30% ] 0563/1000 VUs  0m39.9s/2m15.0s

running (0m40.9s), 0584/1000 VUs, 632869 complete and 0 interrupted iterations
ramp   [  30% ] 0584/1000 VUs  0m40.9s/2m15.0s

running (0m41.9s), 0606/1000 VUs, 650612 complete and 0 interrupted iterations
ramp   [  31% ] 0606/1000 VUs  0m41.9s/2m15.0s

running (0m42.9s), 0628/1000 VUs, 668133 complete and 0 interrupted iterations
ramp   [  32% ] 0628/1000 VUs  0m42.9s/2m15.0s

running (0m43.9s), 0650/1000 VUs, 684917 complete and 0 interrupted iterations
ramp   [  33% ] 0650/1000 VUs  0m43.9s/2m15.0s

running (0m44.9s), 0671/1000 VUs, 701808 complete and 0 interrupted iterations
ramp   [  33% ] 0671/1000 VUs  0m44.9s/2m15.0s

running (0m45.9s), 0693/1000 VUs, 718936 complete and 0 interrupted iterations
ramp   [  34% ] 0693/1000 VUs  0m45.9s/2m15.0s

running (0m46.9s), 0715/1000 VUs, 736258 complete and 0 interrupted iterations
ramp   [  35% ] 0715/1000 VUs  0m46.9s/2m15.0s

running (0m47.9s), 0737/1000 VUs, 753108 complete and 0 interrupted iterations
ramp   [  36% ] 0737/1000 VUs  0m47.9s/2m15.0s

running (0m48.9s), 0759/1000 VUs, 770037 complete and 0 interrupted iterations
ramp   [  36% ] 0759/1000 VUs  0m48.9s/2m15.0s

running (0m49.9s), 0780/1000 VUs, 786487 complete and 0 interrupted iterations
ramp   [  37% ] 0780/1000 VUs  0m49.9s/2m15.0s

running (0m50.9s), 0802/1000 VUs, 803769 complete and 0 interrupted iterations
ramp   [  38% ] 0802/1000 VUs  0m50.9s/2m15.0s

running (0m51.9s), 0824/1000 VUs, 821420 complete and 0 interrupted iterations
ramp   [  38% ] 0824/1000 VUs  0m51.9s/2m15.0s

running (0m52.9s), 0846/1000 VUs, 838801 complete and 0 interrupted iterations
ramp   [  39% ] 0846/1000 VUs  0m52.9s/2m15.0s

running (0m53.9s), 0867/1000 VUs, 856118 complete and 0 interrupted iterations
ramp   [  40% ] 0867/1000 VUs  0m53.9s/2m15.0s

running (0m54.9s), 0889/1000 VUs, 872869 complete and 0 interrupted iterations
ramp   [  41% ] 0889/1000 VUs  0m54.9s/2m15.0s

running (0m55.9s), 0911/1000 VUs, 889956 complete and 0 interrupted iterations
ramp   [  41% ] 0911/1000 VUs  0m55.9s/2m15.0s

running (0m56.9s), 0933/1000 VUs, 907104 complete and 0 interrupted iterations
ramp   [  42% ] 0933/1000 VUs  0m56.9s/2m15.0s

running (0m57.9s), 0954/1000 VUs, 924439 complete and 0 interrupted iterations
ramp   [  43% ] 0954/1000 VUs  0m57.9s/2m15.0s

running (0m58.9s), 0976/1000 VUs, 941357 complete and 0 interrupted iterations
ramp   [  44% ] 0976/1000 VUs  0m58.9s/2m15.0s

running (0m59.9s), 0998/1000 VUs, 958235 complete and 0 interrupted iterations
ramp   [  44% ] 0998/1000 VUs  0m59.9s/2m15.0s

running (1m00.9s), 1000/1000 VUs, 975388 complete and 0 interrupted iterations
ramp   [  45% ] 1000/1000 VUs  1m00.9s/2m15.0s

running (1m01.9s), 1000/1000 VUs, 992297 complete and 0 interrupted iterations
ramp   [  46% ] 1000/1000 VUs  1m01.9s/2m15.0s

running (1m02.9s), 1000/1000 VUs, 1009237 complete and 0 interrupted iterations
ramp   [  47% ] 1000/1000 VUs  1m02.9s/2m15.0s

running (1m03.9s), 1000/1000 VUs, 1026126 complete and 0 interrupted iterations
ramp   [  47% ] 1000/1000 VUs  1m03.9s/2m15.0s

running (1m04.9s), 1000/1000 VUs, 1042453 complete and 0 interrupted iterations
ramp   [  48% ] 1000/1000 VUs  1m04.9s/2m15.0s

running (1m05.9s), 1000/1000 VUs, 1058771 complete and 0 interrupted iterations
ramp   [  49% ] 1000/1000 VUs  1m05.9s/2m15.0s

running (1m06.9s), 1000/1000 VUs, 1075511 complete and 0 interrupted iterations
ramp   [  50% ] 1000/1000 VUs  1m06.9s/2m15.0s

running (1m07.9s), 1000/1000 VUs, 1092284 complete and 0 interrupted iterations
ramp   [  50% ] 1000/1000 VUs  1m07.9s/2m15.0s

running (1m08.9s), 1000/1000 VUs, 1109204 complete and 0 interrupted iterations
ramp   [  51% ] 1000/1000 VUs  1m08.9s/2m15.0s

running (1m09.9s), 1000/1000 VUs, 1125820 complete and 0 interrupted iterations
ramp   [  52% ] 1000/1000 VUs  1m09.9s/2m15.0s

running (1m10.9s), 1000/1000 VUs, 1142730 complete and 0 interrupted iterations
ramp   [  53% ] 1000/1000 VUs  1m10.9s/2m15.0s

running (1m11.9s), 1000/1000 VUs, 1159717 complete and 0 interrupted iterations
ramp   [  53% ] 1000/1000 VUs  1m11.9s/2m15.0s

running (1m12.9s), 1000/1000 VUs, 1176733 complete and 0 interrupted iterations
ramp   [  54% ] 1000/1000 VUs  1m12.9s/2m15.0s

running (1m13.9s), 1000/1000 VUs, 1193626 complete and 0 interrupted iterations
ramp   [  55% ] 1000/1000 VUs  1m13.9s/2m15.0s

running (1m14.9s), 1000/1000 VUs, 1209648 complete and 0 interrupted iterations
ramp   [  56% ] 1000/1000 VUs  1m14.9s/2m15.0s

running (1m15.9s), 1000/1000 VUs, 1226860 complete and 0 interrupted iterations
ramp   [  56% ] 1000/1000 VUs  1m15.9s/2m15.0s

running (1m16.9s), 1000/1000 VUs, 1243954 complete and 0 interrupted iterations
ramp   [  57% ] 1000/1000 VUs  1m16.9s/2m15.0s

running (1m17.9s), 1000/1000 VUs, 1261078 complete and 0 interrupted iterations
ramp   [  58% ] 1000/1000 VUs  1m17.9s/2m15.0s

running (1m18.9s), 1000/1000 VUs, 1278200 complete and 0 interrupted iterations
ramp   [  58% ] 1000/1000 VUs  1m18.9s/2m15.0s

running (1m19.9s), 1000/1000 VUs, 1294775 complete and 0 interrupted iterations
ramp   [  59% ] 1000/1000 VUs  1m19.9s/2m15.0s

running (1m20.9s), 1000/1000 VUs, 1311762 complete and 0 interrupted iterations
ramp   [  60% ] 1000/1000 VUs  1m20.9s/2m15.0s

running (1m21.9s), 1000/1000 VUs, 1328696 complete and 0 interrupted iterations
ramp   [  61% ] 1000/1000 VUs  1m21.9s/2m15.0s

running (1m22.9s), 1000/1000 VUs, 1345570 complete and 0 interrupted iterations
ramp   [  61% ] 1000/1000 VUs  1m22.9s/2m15.0s

running (1m23.9s), 1000/1000 VUs, 1362817 complete and 0 interrupted iterations
ramp   [  62% ] 1000/1000 VUs  1m23.9s/2m15.0s

running (1m24.9s), 1000/1000 VUs, 1379524 complete and 0 interrupted iterations
ramp   [  63% ] 1000/1000 VUs  1m24.9s/2m15.0s

running (1m25.9s), 1000/1000 VUs, 1396618 complete and 0 interrupted iterations
ramp   [  64% ] 1000/1000 VUs  1m25.9s/2m15.0s

running (1m26.9s), 1000/1000 VUs, 1413695 complete and 0 interrupted iterations
ramp   [  64% ] 1000/1000 VUs  1m26.9s/2m15.0s

running (1m27.9s), 1000/1000 VUs, 1430616 complete and 0 interrupted iterations
ramp   [  65% ] 1000/1000 VUs  1m27.9s/2m15.0s

running (1m28.9s), 1000/1000 VUs, 1447794 complete and 0 interrupted iterations
ramp   [  66% ] 1000/1000 VUs  1m28.9s/2m15.0s

running (1m29.9s), 1000/1000 VUs, 1464549 complete and 0 interrupted iterations
ramp   [  67% ] 1000/1000 VUs  1m29.9s/2m15.0s

running (1m30.9s), 1000/1000 VUs, 1481412 complete and 0 interrupted iterations
ramp   [  67% ] 1000/1000 VUs  1m30.9s/2m15.0s

running (1m31.9s), 1000/1000 VUs, 1497597 complete and 0 interrupted iterations
ramp   [  68% ] 1000/1000 VUs  1m31.9s/2m15.0s

running (1m32.9s), 1000/1000 VUs, 1514659 complete and 0 interrupted iterations
ramp   [  69% ] 1000/1000 VUs  1m32.9s/2m15.0s

running (1m33.9s), 1000/1000 VUs, 1531552 complete and 0 interrupted iterations
ramp   [  70% ] 1000/1000 VUs  1m33.9s/2m15.0s

running (1m34.9s), 1000/1000 VUs, 1548069 complete and 0 interrupted iterations
ramp   [  70% ] 1000/1000 VUs  1m34.9s/2m15.0s

running (1m35.9s), 1000/1000 VUs, 1564982 complete and 0 interrupted iterations
ramp   [  71% ] 1000/1000 VUs  1m35.9s/2m15.0s

running (1m36.9s), 1000/1000 VUs, 1581876 complete and 0 interrupted iterations
ramp   [  72% ] 1000/1000 VUs  1m36.9s/2m15.0s

running (1m37.9s), 1000/1000 VUs, 1598689 complete and 0 interrupted iterations
ramp   [  73% ] 1000/1000 VUs  1m37.9s/2m15.0s

running (1m38.9s), 1000/1000 VUs, 1615617 complete and 0 interrupted iterations
ramp   [  73% ] 1000/1000 VUs  1m38.9s/2m15.0s

running (1m39.9s), 1000/1000 VUs, 1631964 complete and 0 interrupted iterations
ramp   [  74% ] 1000/1000 VUs  1m39.9s/2m15.0s

running (1m40.9s), 1000/1000 VUs, 1648890 complete and 0 interrupted iterations
ramp   [  75% ] 1000/1000 VUs  1m40.9s/2m15.0s

running (1m41.9s), 1000/1000 VUs, 1665564 complete and 0 interrupted iterations
ramp   [  76% ] 1000/1000 VUs  1m41.9s/2m15.0s

running (1m42.9s), 1000/1000 VUs, 1681912 complete and 0 interrupted iterations
ramp   [  76% ] 1000/1000 VUs  1m42.9s/2m15.0s

running (1m43.9s), 1000/1000 VUs, 1698845 complete and 0 interrupted iterations
ramp   [  77% ] 1000/1000 VUs  1m43.9s/2m15.0s

running (1m44.9s), 1000/1000 VUs, 1715270 complete and 0 interrupted iterations
ramp   [  78% ] 1000/1000 VUs  1m44.9s/2m15.0s

running (1m45.9s), 1000/1000 VUs, 1732016 complete and 0 interrupted iterations
ramp   [  78% ] 1000/1000 VUs  1m45.9s/2m15.0s

running (1m46.9s), 1000/1000 VUs, 1748957 complete and 0 interrupted iterations
ramp   [  79% ] 1000/1000 VUs  1m46.9s/2m15.0s

running (1m47.9s), 1000/1000 VUs, 1765925 complete and 0 interrupted iterations
ramp   [  80% ] 1000/1000 VUs  1m47.9s/2m15.0s

running (1m48.9s), 1000/1000 VUs, 1782662 complete and 0 interrupted iterations
ramp   [  81% ] 1000/1000 VUs  1m48.9s/2m15.0s

running (1m49.9s), 1000/1000 VUs, 1799254 complete and 0 interrupted iterations
ramp   [  81% ] 1000/1000 VUs  1m49.9s/2m15.0s

running (1m50.9s), 1000/1000 VUs, 1815915 complete and 0 interrupted iterations
ramp   [  82% ] 1000/1000 VUs  1m50.9s/2m15.0s

running (1m51.9s), 1000/1000 VUs, 1832651 complete and 0 interrupted iterations
ramp   [  83% ] 1000/1000 VUs  1m51.9s/2m15.0s

running (1m52.9s), 1000/1000 VUs, 1849220 complete and 0 interrupted iterations
ramp   [  84% ] 1000/1000 VUs  1m52.9s/2m15.0s

running (1m53.9s), 1000/1000 VUs, 1866078 complete and 0 interrupted iterations
ramp   [  84% ] 1000/1000 VUs  1m53.9s/2m15.0s

running (1m54.9s), 1000/1000 VUs, 1881858 complete and 0 interrupted iterations
ramp   [  85% ] 1000/1000 VUs  1m54.9s/2m15.0s

running (1m55.9s), 1000/1000 VUs, 1898150 complete and 0 interrupted iterations
ramp   [  86% ] 1000/1000 VUs  1m55.9s/2m15.0s

running (1m56.9s), 1000/1000 VUs, 1914156 complete and 0 interrupted iterations
ramp   [  87% ] 1000/1000 VUs  1m56.9s/2m15.0s

running (1m57.9s), 1000/1000 VUs, 1930050 complete and 0 interrupted iterations
ramp   [  87% ] 1000/1000 VUs  1m57.9s/2m15.0s

running (1m58.9s), 1000/1000 VUs, 1946041 complete and 0 interrupted iterations
ramp   [  88% ] 1000/1000 VUs  1m58.9s/2m15.0s

running (1m59.9s), 1000/1000 VUs, 1961966 complete and 0 interrupted iterations
ramp   [  89% ] 1000/1000 VUs  1m59.9s/2m15.0s

running (2m00.9s), 0941/1000 VUs, 1978289 complete and 0 interrupted iterations
ramp   [  90% ] 0941/1000 VUs  2m00.9s/2m15.0s

running (2m01.9s), 0876/1000 VUs, 1994806 complete and 0 interrupted iterations
ramp   [  90% ] 0876/1000 VUs  2m01.9s/2m15.0s

running (2m02.9s), 0808/1000 VUs, 2010913 complete and 0 interrupted iterations
ramp   [  91% ] 0808/1000 VUs  2m02.9s/2m15.0s

running (2m03.9s), 0740/1000 VUs, 2027410 complete and 0 interrupted iterations
ramp   [  92% ] 0740/1000 VUs  2m03.9s/2m15.0s

running (2m04.9s), 0675/1000 VUs, 2043062 complete and 0 interrupted iterations
ramp   [  93% ] 0675/1000 VUs  2m04.9s/2m15.0s

running (2m05.9s), 0607/1000 VUs, 2058917 complete and 0 interrupted iterations
ramp   [  93% ] 0607/1000 VUs  2m05.9s/2m15.0s

running (2m06.9s), 0540/1000 VUs, 2074587 complete and 0 interrupted iterations
ramp   [  94% ] 0540/1000 VUs  2m06.9s/2m15.0s

running (2m07.9s), 0474/1000 VUs, 2090862 complete and 0 interrupted iterations
ramp   [  95% ] 0474/1000 VUs  2m07.9s/2m15.0s

running (2m08.9s), 0407/1000 VUs, 2107206 complete and 0 interrupted iterations
ramp   [  96% ] 0407/1000 VUs  2m08.9s/2m15.0s

running (2m09.9s), 0339/1000 VUs, 2123440 complete and 0 interrupted iterations
ramp   [  96% ] 0339/1000 VUs  2m09.9s/2m15.0s

running (2m10.9s), 0272/1000 VUs, 2140339 complete and 0 interrupted iterations
ramp   [  97% ] 0272/1000 VUs  2m10.9s/2m15.0s

running (2m11.9s), 0206/1000 VUs, 2157324 complete and 0 interrupted iterations
ramp   [  98% ] 0206/1000 VUs  2m11.9s/2m15.0s

running (2m12.9s), 0139/1000 VUs, 2174435 complete and 0 interrupted iterations
ramp   [  98% ] 0139/1000 VUs  2m12.9s/2m15.0s

running (2m13.9s), 0072/1000 VUs, 2191714 complete and 0 interrupted iterations
ramp   [  99% ] 0072/1000 VUs  2m13.9s/2m15.0s

running (2m14.9s), 0005/1000 VUs, 2207733 complete and 0 interrupted iterations
ramp   [ 100% ] 0005/1000 VUs  2m14.9s/2m15.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=124.71ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 2208051 16355.854098/s
    checks_succeeded...: 100.00% 2208051 out of 2208051
    checks_failed......: 0.00%   0 out of 2208051

    ✓ 200

    HTTP
    http_req_duration..............: avg=40.97ms min=461µs    med=26.84ms max=795.62ms p(90)=109.69ms p(95)=124.71ms
      { expected_response:true }...: avg=40.97ms min=461µs    med=26.84ms max=795.62ms p(90)=109.69ms p(95)=124.71ms
    http_req_failed................: 0.00%   0 out of 2208051
    http_reqs......................: 2208051 16355.854098/s

    EXECUTION
    iteration_duration.............: avg=41.02ms min=481.87µs med=26.89ms max=795.65ms p(90)=109.73ms p(95)=124.78ms
    iterations.....................: 2208051 16355.854098/s
    vus............................: 5       min=1            max=1000
    vus_max........................: 1000    min=1000         max=1000

    NETWORK
    data_received..................: 45 GB   336 MB/s
    data_sent......................: 250 MB  1.8 MB/s



running (2m15.0s), 0000/1000 VUs, 2208051 complete and 0 interrupted iterations
ramp ✓ [ 100% ] 0000/1000 VUs  2m15s